/* automatically generated by rust-bindgen 0.55.1 */

pub const ZFS_MAX_DATASET_NAME_LEN: u32 = 256;
pub const ZPOOL_ROOTFS_PROPS: &'static [u8; 15usize] = b"root-props-nvl\0";
pub const ZFS_WRITTEN_PROP_PREFIX_LEN: u32 = 8;
pub const ZFS_DELEG_PERM_UID: &'static [u8; 4usize] = b"uid\0";
pub const ZFS_DELEG_PERM_GID: &'static [u8; 4usize] = b"gid\0";
pub const ZFS_DELEG_PERM_GROUPS: &'static [u8; 7usize] = b"groups\0";
pub const ZFS_MLSLABEL_DEFAULT: &'static [u8; 5usize] = b"none\0";
pub const ZFS_SMB_ACL_SRC: &'static [u8; 4usize] = b"src\0";
pub const ZFS_SMB_ACL_TARGET: &'static [u8; 7usize] = b"target\0";
pub const DEFAULT_PBKDF2_ITERATIONS: u32 = 350000;
pub const MIN_PBKDF2_ITERATIONS: u32 = 100000;
pub const SPA_VERSION_1: u32 = 1;
pub const SPA_VERSION_2: u32 = 2;
pub const SPA_VERSION_3: u32 = 3;
pub const SPA_VERSION_4: u32 = 4;
pub const SPA_VERSION_5: u32 = 5;
pub const SPA_VERSION_6: u32 = 6;
pub const SPA_VERSION_7: u32 = 7;
pub const SPA_VERSION_8: u32 = 8;
pub const SPA_VERSION_9: u32 = 9;
pub const SPA_VERSION_10: u32 = 10;
pub const SPA_VERSION_11: u32 = 11;
pub const SPA_VERSION_12: u32 = 12;
pub const SPA_VERSION_13: u32 = 13;
pub const SPA_VERSION_14: u32 = 14;
pub const SPA_VERSION_15: u32 = 15;
pub const SPA_VERSION_16: u32 = 16;
pub const SPA_VERSION_17: u32 = 17;
pub const SPA_VERSION_18: u32 = 18;
pub const SPA_VERSION_19: u32 = 19;
pub const SPA_VERSION_20: u32 = 20;
pub const SPA_VERSION_21: u32 = 21;
pub const SPA_VERSION_22: u32 = 22;

pub use self::zfs_share_op::Type as zfs_share_op_t;
pub mod zfs_smb_acl_op {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_SMB_ACL_ADD: Type = 0;
    pub const ZFS_SMB_ACL_REMOVE: Type = 1;
    pub const ZFS_SMB_ACL_RENAME: Type = 2;
    pub const ZFS_SMB_ACL_PURGE: Type = 3;
}
pub use self::zfs_smb_acl_op::Type as zfs_smb_acl_op_t;
pub mod zfs_cache_type {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_CACHE_NONE: Type = 0;
    pub const ZFS_CACHE_METADATA: Type = 1;
    pub const ZFS_CACHE_ALL: Type = 2;
}
pub use self::zfs_cache_type::Type as zfs_cache_type_t;
pub mod zfs_sync_type_t {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_SYNC_STANDARD: Type = 0;
    pub const ZFS_SYNC_ALWAYS: Type = 1;
    pub const ZFS_SYNC_DISABLED: Type = 2;
}
pub mod zfs_xattr_type_t {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_XATTR_OFF: Type = 0;
    pub const ZFS_XATTR_DIR: Type = 1;
    pub const ZFS_XATTR_SA: Type = 2;
}
pub mod zfs_dnsize_type_t {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_DNSIZE_LEGACY: Type = 0;
    pub const ZFS_DNSIZE_AUTO: Type = 1;
    pub const ZFS_DNSIZE_1K: Type = 1024;
    pub const ZFS_DNSIZE_2K: Type = 2048;
    pub const ZFS_DNSIZE_4K: Type = 4096;
    pub const ZFS_DNSIZE_8K: Type = 8192;
    pub const ZFS_DNSIZE_16K: Type = 16384;
}
pub mod zfs_redundant_metadata_type_t {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_REDUNDANT_METADATA_ALL: Type = 0;
    pub const ZFS_REDUNDANT_METADATA_MOST: Type = 1;
}
pub mod zfs_volmode_t {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_VOLMODE_DEFAULT: Type = 0;
    pub const ZFS_VOLMODE_GEOM: Type = 1;
    pub const ZFS_VOLMODE_DEV: Type = 2;
    pub const ZFS_VOLMODE_NONE: Type = 3;
}
pub mod zfs_keystatus {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_KEYSTATUS_NONE: Type = 0;
    pub const ZFS_KEYSTATUS_UNAVAILABLE: Type = 1;
    pub const ZFS_KEYSTATUS_AVAILABLE: Type = 2;
}
pub use self::zfs_keystatus::Type as zfs_keystatus_t;
pub mod zfs_keyformat {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_KEYFORMAT_NONE: Type = 0;
    pub const ZFS_KEYFORMAT_RAW: Type = 1;
    pub const ZFS_KEYFORMAT_HEX: Type = 2;
    pub const ZFS_KEYFORMAT_PASSPHRASE: Type = 3;
    pub const ZFS_KEYFORMAT_FORMATS: Type = 4;
}
pub use self::zfs_keyformat::Type as zfs_keyformat_t;
pub mod zfs_key_location {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_KEYLOCATION_NONE: Type = 0;
    pub const ZFS_KEYLOCATION_PROMPT: Type = 1;
    pub const ZFS_KEYLOCATION_URI: Type = 2;
    pub const ZFS_KEYLOCATION_LOCATIONS: Type = 3;
}
pub use self::zfs_key_location::Type as zfs_keylocation_t;
#[repr(C)]
pub struct zpool_load_policy {
    pub zlp_rewind: u32,
    pub zlp_maxmeta: u64,
    pub zlp_maxdata: u64,
    pub zlp_txg: u64,
}
#[test]
fn bindgen_test_layout_zpool_load_policy() {
    assert_eq!(
        ::std::mem::size_of::<zpool_load_policy>(),
        32usize,
        concat!("Size of: ", stringify!(zpool_load_policy))
    );
    assert_eq!(
        ::std::mem::align_of::<zpool_load_policy>(),
        8usize,
        concat!("Alignment of ", stringify!(zpool_load_policy))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<zpool_load_policy>())).zlp_rewind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(zpool_load_policy),
            "::",
            stringify!(zlp_rewind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<zpool_load_policy>())).zlp_maxmeta as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(zpool_load_policy),
            "::",
            stringify!(zlp_maxmeta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<zpool_load_policy>())).zlp_maxdata as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(zpool_load_policy),
            "::",
            stringify!(zlp_maxdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<zpool_load_policy>())).zlp_txg as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(zpool_load_policy),
            "::",
            stringify!(zlp_txg)
        )
    );
}
pub type zpool_load_policy_t = zpool_load_policy;
pub mod vdev_state {
    pub type Type = ::std::os::raw::c_uint;
    pub const VDEV_STATE_UNKNOWN: Type = 0;
    pub const VDEV_STATE_CLOSED: Type = 1;
    pub const VDEV_STATE_OFFLINE: Type = 2;
    pub const VDEV_STATE_REMOVED: Type = 3;
    pub const VDEV_STATE_CANT_OPEN: Type = 4;
    pub const VDEV_STATE_FAULTED: Type = 5;
    pub const VDEV_STATE_DEGRADED: Type = 6;
    pub const VDEV_STATE_HEALTHY: Type = 7;
}
pub use self::vdev_state::Type as vdev_state_t;
pub mod vdev_aux {
    pub type Type = ::std::os::raw::c_uint;
    pub const VDEV_AUX_NONE: Type = 0;
    pub const VDEV_AUX_OPEN_FAILED: Type = 1;
    pub const VDEV_AUX_CORRUPT_DATA: Type = 2;
    pub const VDEV_AUX_NO_REPLICAS: Type = 3;
    pub const VDEV_AUX_BAD_GUID_SUM: Type = 4;
    pub const VDEV_AUX_TOO_SMALL: Type = 5;
    pub const VDEV_AUX_BAD_LABEL: Type = 6;
    pub const VDEV_AUX_VERSION_NEWER: Type = 7;
    pub const VDEV_AUX_VERSION_OLDER: Type = 8;
    pub const VDEV_AUX_UNSUP_FEAT: Type = 9;
    pub const VDEV_AUX_SPARED: Type = 10;
    pub const VDEV_AUX_ERR_EXCEEDED: Type = 11;
    pub const VDEV_AUX_IO_FAILURE: Type = 12;
    pub const VDEV_AUX_BAD_LOG: Type = 13;
    pub const VDEV_AUX_EXTERNAL: Type = 14;
    pub const VDEV_AUX_SPLIT_POOL: Type = 15;
    pub const VDEV_AUX_BAD_ASHIFT: Type = 16;
    pub const VDEV_AUX_EXTERNAL_PERSIST: Type = 17;
    pub const VDEV_AUX_ACTIVE: Type = 18;
    pub const VDEV_AUX_CHILDREN_OFFLINE: Type = 19;
    pub const VDEV_AUX_ASHIFT_TOO_BIG: Type = 20;
}
pub use self::vdev_aux::Type as vdev_aux_t;
#[repr(C)]
pub struct vdev_rebuild_stat {
    pub vrs_state: u64,
    pub vrs_start_time: u64,
    pub vrs_end_time: u64,
    pub vrs_scan_time_ms: u64,
    pub vrs_bytes_scanned: u64,
    pub vrs_bytes_issued: u64,
    pub vrs_bytes_rebuilt: u64,
    pub vrs_bytes_est: u64,
    pub vrs_errors: u64,
    pub vrs_pass_time_ms: u64,
    pub vrs_pass_bytes_scanned: u64,
    pub vrs_pass_bytes_issued: u64,
}
#[test]
fn bindgen_test_layout_vdev_rebuild_stat() {
    assert_eq!(
        ::std::mem::size_of::<vdev_rebuild_stat>(),
        96usize,
        concat!("Size of: ", stringify!(vdev_rebuild_stat))
    );
    assert_eq!(
        ::std::mem::align_of::<vdev_rebuild_stat>(),
        8usize,
        concat!("Alignment of ", stringify!(vdev_rebuild_stat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_start_time as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_start_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_end_time as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_end_time)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_scan_time_ms as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_scan_time_ms)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_bytes_scanned as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_bytes_scanned)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_bytes_issued as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_bytes_issued)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_bytes_rebuilt as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_bytes_rebuilt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_bytes_est as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_bytes_est)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_errors as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_pass_time_ms as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_pass_time_ms)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_pass_bytes_scanned as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_pass_bytes_scanned)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_rebuild_stat>())).vrs_pass_bytes_issued as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_rebuild_stat),
            "::",
            stringify!(vrs_pass_bytes_issued)
        )
    );
}
pub type vdev_rebuild_stat_t = vdev_rebuild_stat;
pub mod zpool_errata {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZPOOL_ERRATA_NONE: Type = 0;
    pub const ZPOOL_ERRATA_ZOL_2094_SCRUB: Type = 1;
    pub const ZPOOL_ERRATA_ZOL_2094_ASYNC_DESTROY: Type = 2;
    pub const ZPOOL_ERRATA_ZOL_6845_ENCRYPTION: Type = 3;
    pub const ZPOOL_ERRATA_ZOL_8308_ENCRYPTION: Type = 4;
}
pub use self::zpool_errata::Type as zpool_errata_t;
#[repr(C)]
pub struct vdev_stat {
    pub vs_timestamp: hrtime_t,
    pub vs_state: u64,
    pub vs_aux: u64,
    pub vs_alloc: u64,
    pub vs_space: u64,
    pub vs_dspace: u64,
    pub vs_rsize: u64,
    pub vs_esize: u64,
    pub vs_ops: [u64; 6usize],
    pub vs_bytes: [u64; 6usize],
    pub vs_read_errors: u64,
    pub vs_write_errors: u64,
    pub vs_checksum_errors: u64,
    pub vs_initialize_errors: u64,
    pub vs_self_healed: u64,
    pub vs_scan_removing: u64,
    pub vs_scan_processed: u64,
    pub vs_fragmentation: u64,
    pub vs_initialize_bytes_done: u64,
    pub vs_initialize_bytes_est: u64,
    pub vs_initialize_state: u64,
    pub vs_initialize_action_time: u64,
    pub vs_checkpoint_space: u64,
    pub vs_resilver_deferred: u64,
    pub vs_slow_ios: u64,
    pub vs_trim_errors: u64,
    pub vs_trim_notsup: u64,
    pub vs_trim_bytes_done: u64,
    pub vs_trim_bytes_est: u64,
    pub vs_trim_state: u64,
    pub vs_trim_action_time: u64,
    pub vs_rebuild_processed: u64,
    pub vs_configured_ashift: u64,
    pub vs_logical_ashift: u64,
    pub vs_physical_ashift: u64,
}
#[test]
fn bindgen_test_layout_vdev_stat() {
    assert_eq!(
        ::std::mem::size_of::<vdev_stat>(),
        360usize,
        concat!("Size of: ", stringify!(vdev_stat))
    );
    assert_eq!(
        ::std::mem::align_of::<vdev_stat>(),
        8usize,
        concat!("Alignment of ", stringify!(vdev_stat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_timestamp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_timestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_aux as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_aux)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_alloc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_space as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_space)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_dspace as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_dspace)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_rsize as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_rsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_esize as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_esize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_ops as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_ops)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_bytes as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_read_errors as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_read_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_write_errors as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_write_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_checksum_errors as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_checksum_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_initialize_errors as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_initialize_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_self_healed as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_self_healed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_scan_removing as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_scan_removing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_scan_processed as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_scan_processed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_fragmentation as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_fragmentation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_stat>())).vs_initialize_bytes_done as *const _ as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_initialize_bytes_done)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_stat>())).vs_initialize_bytes_est as *const _ as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_initialize_bytes_est)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_initialize_state as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_initialize_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vdev_stat>())).vs_initialize_action_time as *const _ as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_initialize_action_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_checkpoint_space as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_checkpoint_space)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_resilver_deferred as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_resilver_deferred)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_slow_ios as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_slow_ios)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_trim_errors as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_trim_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_trim_notsup as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_trim_notsup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_trim_bytes_done as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_trim_bytes_done)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_trim_bytes_est as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_trim_bytes_est)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_trim_state as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_trim_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_trim_action_time as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_trim_action_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_rebuild_processed as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_rebuild_processed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_configured_ashift as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_configured_ashift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_logical_ashift as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_logical_ashift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat>())).vs_physical_ashift as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat),
            "::",
            stringify!(vs_physical_ashift)
        )
    );
}
pub type vdev_stat_t = vdev_stat;
#[repr(C)]
pub struct vdev_stat_ex {
    pub vsx_active_queue: [u64; 9usize],
    pub vsx_pend_queue: [u64; 9usize],
    pub vsx_queue_histo: [[u64; 37usize]; 9usize],
    pub vsx_total_histo: [[u64; 37usize]; 7usize],
    pub vsx_disk_histo: [[u64; 37usize]; 7usize],
    pub vsx_ind_histo: [[u64; 25usize]; 9usize],
    pub vsx_agg_histo: [[u64; 25usize]; 9usize],
}
#[test]
fn bindgen_test_layout_vdev_stat_ex() {
    assert_eq!(
        ::std::mem::size_of::<vdev_stat_ex>(),
        10552usize,
        concat!("Size of: ", stringify!(vdev_stat_ex))
    );
    assert_eq!(
        ::std::mem::align_of::<vdev_stat_ex>(),
        8usize,
        concat!("Alignment of ", stringify!(vdev_stat_ex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat_ex>())).vsx_active_queue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat_ex),
            "::",
            stringify!(vsx_active_queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat_ex>())).vsx_pend_queue as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat_ex),
            "::",
            stringify!(vsx_pend_queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat_ex>())).vsx_queue_histo as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat_ex),
            "::",
            stringify!(vsx_queue_histo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat_ex>())).vsx_total_histo as *const _ as usize },
        2808usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat_ex),
            "::",
            stringify!(vsx_total_histo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat_ex>())).vsx_disk_histo as *const _ as usize },
        4880usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat_ex),
            "::",
            stringify!(vsx_disk_histo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat_ex>())).vsx_ind_histo as *const _ as usize },
        6952usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat_ex),
            "::",
            stringify!(vsx_ind_histo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vdev_stat_ex>())).vsx_agg_histo as *const _ as usize },
        8752usize,
        concat!(
            "Offset of field: ",
            stringify!(vdev_stat_ex),
            "::",
            stringify!(vsx_agg_histo)
        )
    );
}
pub type vdev_stat_ex_t = vdev_stat_ex;
pub mod pool_initialize_func {
    pub type Type = ::std::os::raw::c_uint;
    pub const POOL_INITIALIZE_START: Type = 0;
    pub const POOL_INITIALIZE_CANCEL: Type = 1;
    pub const POOL_INITIALIZE_SUSPEND: Type = 2;
    pub const POOL_INITIALIZE_FUNCS: Type = 3;
}
pub use self::pool_initialize_func::Type as pool_initialize_func_t;
pub mod pool_trim_func {
    pub type Type = ::std::os::raw::c_uint;
    pub const POOL_TRIM_START: Type = 0;
    pub const POOL_TRIM_CANCEL: Type = 1;
    pub const POOL_TRIM_SUSPEND: Type = 2;
    pub const POOL_TRIM_FUNCS: Type = 3;
}
pub use self::pool_trim_func::Type as pool_trim_func_t;
pub mod vdev_initializing_state_t {
    pub type Type = ::std::os::raw::c_uint;
    pub const VDEV_INITIALIZE_NONE: Type = 0;
    pub const VDEV_INITIALIZE_ACTIVE: Type = 1;
