/* automatically generated by rust-bindgen 0.55.1 */

pub const ZPOOL_ROOTFS_PROPS: &'static [u8; 15usize] = b"root-props-nvl\0";
pub const ZPOOL_NO_REWIND: u32 = 1;
pub const ZPOOL_NEVER_REWIND: u32 = 2;
pub const ZPOOL_TRY_REWIND: u32 = 4;
pub const ZPOOL_DO_REWIND: u32 = 8;
pub const ZPOOL_EXTREME_REWIND: u32 = 16;
pub const ZPOOL_REWIND_MASK: u32 = 28;
pub const ZPOOL_REWIND_POLICIES: u32 = 31;
pub const ZPOOL_CONFIG_VERSION: &'static [u8; 8usize] = b"version\0";
pub const ZPOOL_CONFIG_POOL_NAME: &'static [u8; 5usize] = b"name\0";
pub const ZPOOL_CONFIG_POOL_STATE: &'static [u8; 6usize] = b"state\0";
pub const ZPOOL_CONFIG_POOL_TXG: &'static [u8; 4usize] = b"txg\0";
pub const ZPOOL_CONFIG_POOL_GUID: &'static [u8; 10usize] = b"pool_guid\0";
pub const ZPOOL_CONFIG_CREATE_TXG: &'static [u8; 11usize] = b"create_txg\0";
pub const ZPOOL_CONFIG_TOP_GUID: &'static [u8; 9usize] = b"top_guid\0";
pub const ZPOOL_CONFIG_VDEV_TREE: &'static [u8; 10usize] = b"vdev_tree\0";
pub const ZPOOL_CONFIG_TYPE: &'static [u8; 5usize] = b"type\0";
pub const ZPOOL_CONFIG_CHILDREN: &'static [u8; 9usize] = b"children\0";
pub const ZPOOL_CONFIG_ID: &'static [u8; 3usize] = b"id\0";
pub const ZPOOL_CONFIG_GUID: &'static [u8; 5usize] = b"guid\0";
pub const ZPOOL_CONFIG_INDIRECT_OBJECT: &'static [u8; 28usize] = b"com.delphix:indirect_object\0";
pub const ZPOOL_CONFIG_INDIRECT_BIRTHS: &'static [u8; 28usize] = b"com.delphix:indirect_births\0";

pub const VDEV_LEAF_ZAP_TRIM_SECURE: &'static [u8; 32usize] = b"org.zfsonlinux:vdev_trim_secure\0";
pub const ZPOOL_CACHE_BOOT: &'static [u8; 22usize] = b"/boot/zfs/zpool.cache\0";
pub const ZPOOL_CACHE: &'static [u8; 21usize] = b"/etc/zfs/zpool.cache\0";
pub const VDEV_L_HISTO_BUCKETS: u32 = 37;
pub const VDEV_RQ_HISTO_BUCKETS: u32 = 25;
pub const ZPOOL_ERR_LIST: &'static [u8; 11usize] = b"error list\0";
pub const ZPOOL_ERR_DATASET: &'static [u8; 8usize] = b"dataset\0";
pub const ZPOOL_ERR_OBJECT: &'static [u8; 7usize] = b"object\0";
pub const ZPOOL_HIST_RECORD: &'static [u8; 15usize] = b"history record\0";
pub const ZPOOL_HIST_TIME: &'static [u8; 13usize] = b"history time\0";
pub const ZPOOL_HIST_CMD: &'static [u8; 16usize] = b"history command\0";
pub const ZPOOL_HIST_WHO: &'static [u8; 12usize] = b"history who\0";
pub const ZPOOL_HIST_ZONE: &'static [u8; 13usize] = b"history zone\0";
pub const ZPOOL_HIST_HOST: &'static [u8; 17usize] = b"history hostname\0";
pub const ZPOOL_HIST_TXG: &'static [u8; 12usize] = b"history txg\0";
pub const ZPOOL_HIST_INT_EVENT: &'static [u8; 23usize] = b"history internal event\0";
pub const ZPOOL_HIST_INT_STR: &'static [u8; 21usize] = b"history internal str\0";
pub const ZPOOL_HIST_INT_NAME: &'static [u8; 14usize] = b"internal_name\0";
pub const ZPOOL_HIST_IOCTL: &'static [u8; 6usize] = b"ioctl\0";
pub const ZPOOL_HIST_INPUT_NVL: &'static [u8; 7usize] = b"in_nvl\0";
pub const ZPOOL_HIST_OUTPUT_NVL: &'static [u8; 8usize] = b"out_nvl\0";
pub const ZPOOL_HIST_OUTPUT_SIZE: &'static [u8; 9usize] = b"out_size\0";
pub const ZPOOL_HIST_DSNAME: &'static [u8; 7usize] = b"dsname\0";
pub const ZPOOL_HIST_DSID: &'static [u8; 5usize] = b"dsid\0";
pub const ZPOOL_HIST_ERRNO: &'static [u8; 6usize] = b"errno\0";
pub const ZPOOL_HIDDEN_ARGS: &'static [u8; 12usize] = b"hidden_args\0";
pub const ZPOOL_INITIALIZE_COMMAND: &'static [u8; 19usize] = b"initialize_command\0";
pub const ZPOOL_INITIALIZE_VDEVS: &'static [u8; 17usize] = b"initialize_vdevs\0";
pub const ZPOOL_TRIM_COMMAND: &'static [u8; 13usize] = b"trim_command\0";
pub const ZPOOL_TRIM_VDEVS: &'static [u8; 11usize] = b"trim_vdevs\0";
pub const ZPOOL_TRIM_RATE: &'static [u8; 10usize] = b"trim_rate\0";
pub const ZPOOL_TRIM_SECURE: &'static [u8; 12usize] = b"trim_secure\0";
pub const ZPOOL_WAIT_ACTIVITY: &'static [u8; 14usize] = b"wait_activity\0";
pub const ZPOOL_WAIT_TAG: &'static [u8; 9usize] = b"wait_tag\0";
pub const ZPOOL_WAIT_WAITED: &'static [u8; 12usize] = b"wait_waited\0";
pub type uint_t = ::std::os::raw::c_uint;
pub mod boolean_t {
    pub type Type = ::std::os::raw::c_uint;
    pub const B_FALSE: Type = 0;
    pub const B_TRUE: Type = 1;
}
pub type uchar_t = ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvlist {
    pub nvl_version: i32,
    pub nvl_nvflag: u32,
    pub nvl_priv: u64,
    pub nvl_flag: u32,
    pub nvl_pad: i32,
}
#[test]
fn bindgen_test_layout_nvlist() {
    assert_eq!(
        ::std::mem::size_of::<nvlist>(),
        24usize,
        concat!("Size of: ", stringify!(nvlist))
    );
    assert_eq!(
        ::std::mem::align_of::<nvlist>(),
        8usize,
        concat!("Alignment of ", stringify!(nvlist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvlist>())).nvl_version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nvlist),
            "::",
            stringify!(nvl_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvlist>())).nvl_nvflag as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nvlist),
            "::",
            stringify!(nvl_nvflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvlist>())).nvl_priv as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nvlist),
            "::",
            stringify!(nvl_priv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvlist>())).nvl_flag as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nvlist),
            "::",
            stringify!(nvl_flag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nvlist>())).nvl_pad as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nvlist),
            "::",
            stringify!(nvl_pad)
        )
    );
}
pub type nvlist_t = nvlist;
pub mod zfs_type_t {
    pub type Type = ::std::os::raw::c_uint;
    pub const ZFS_TYPE_FILESYSTEM: Type = 1;
    pub const ZFS_TYPE_SNAPSHOT: Type = 2;
    pub const ZFS_TYPE_VOLUME: Type = 4;
    pub const ZFS_TYPE_POOL: Type = 8;
    pub const ZFS_TYPE_BOOKMARK: Type = 16;
}
pub mod zfs_prop_t {
    pub type Type = ::std::os::raw::c_int;
    pub const ZPROP_CONT: Type = -2;
    pub const ZPROP_INVAL: Type = -1;
    pub const ZFS_PROP_TYPE: Type = 0;
    pub const ZFS_PROP_CREATION: Type = 1;
    pub const ZFS_PROP_USED: Type = 2;
    pub const ZFS_PROP_AVAILABLE: Type = 3;
    pub const ZFS_PROP_REFERENCED: Type = 4;
    pub const ZFS_PROP_COMPRESSRATIO: Type = 5;
    pub const ZFS_PROP_MOUNTED: Type = 6;
    pub const ZFS_PROP_ORIGIN: Type = 7;
    pub const ZFS_PROP_QUOTA: Type = 8;
    pub const ZFS_PROP_RESERVATION: Type = 9;
